[
  {
    "name": "To Kill a Mockingbird",
    "image_url": "https://i.postimg.cc/mrKsbDzk/4411d7d78f84ea7c99ac6d5039ac9fe6.jpg",
    "quantity": 4,
    "author": "Harper Lee",
    "category": "Novel",
    "short_description": "A classic novel set in the American South during the 1930s.",
    "rating": 4,
    "long_description": "To Kill a Mockingbird is a novel by Harper Lee published in 1960. It was immediately successful, winning the Pulitzer Prize, and has become a classic of modern American literature."
  },
  {
    "name": "The Da Vinci Code",
    "image_url": "https://i.postimg.cc/DZsKmTLg/0d00def722c9e84fa85a30797d5a804e.jpg",
    "quantity": 4,
    "author": "Dan Brown",
    "category": "Thriller",
    "short_description": "A thriller novel about a murder in the Louvre Museum.",
    "rating": 3,
    "long_description": "The Da Vinci Code is a mystery thriller novel by Dan Brown. It follows symbologist Robert Langdon and cryptologist Sophie Neveu after a murder in the Louvre Museum in Paris causes them to become involved in a battle between the Priory of Sion and Opus Dei over the possibility of Jesus Christ having been married to Mary Magdalene."
  },
  {
    "name": "Sapiens: A Brief History of Humankind",
    "image_url": "https://i.postimg.cc/3NTQvcZH/a4a78927ba2126abcca4319311b5d20e.jpg",
    "quantity": 4,
    "author": "Yuval Noah Harari",
    "category": "History",
    "short_description": "An exploration of the history of Homo sapiens.",
    "rating": 5,
    "long_description": "Sapiens: A Brief History of Humankind is a book by Yuval Noah Harari first published in Hebrew in Israel in 2011 and in English in 2014. The book surveys the history of humankind from the evolution of archaic human species in the Stone Age up to the twenty-first century, focusing on Homo sapiens."
  },
  {
    "name": "Hamlet",
    "image_url": "https://i.postimg.cc/prJbYJ05/935a434ffc53c5508f2f408a0aba93ba.jpg",
    "quantity": 4,
    "author": "William Shakespeare",
    "category": "Drama",
    "short_description": "A tragedy by William Shakespeare.",
    "rating": 4,
    "long_description": "The Tragedy of Hamlet, Prince of Denmark, often shortened to Hamlet, is a tragedy written by William Shakespeare sometime between 1599 and 1601. It is Shakespeare's longest play, with 30,557 words."
  },
  {
    "name": "Dune",
    "image_url": "https://i.postimg.cc/9XdhhcWX/74efc1cb7b65a93efd058a6f3e738ff5.jpg",
    "quantity": 4,
    "author": "Frank Herbert",
    "category": "Sci-Fi",
    "short_description": "A science fiction novel set in the distant future.",
    "rating": 5,
    "long_description": "Dune is a science fiction novel by American author Frank Herbert, originally published in two separate serials in Analog magazine. Set in the distant future amidst a feudal interstellar society in which various noble houses control planetary fiefs, Dune tells the story of young Paul Atreides, whose family accepts the stewardship of the desert planet Arrakis."
  },
  {
    "name": "Pride and Prejudice",
    "image_url": "https://i.postimg.cc/TPm63DzS/3635001cee01cf44993d9364bc5777da.jpg",
    "quantity": 3,
    "author": "Jane Austen",
    "category": "Novel",
    "short_description": "A romantic novel by Jane Austen.",
    "rating": 4,
    "long_description": "Pride and Prejudice is an 1813 romantic novel of manners written by Jane Austen. The novel follows the character development of Elizabeth Bennet, the dynamic protagonist of the book who learns about the repercussions of hasty judgments and eventually comes to appreciate the difference between superficial goodness and actual goodness."
  },
  {
    "name": "The Girl with the Dragon Tattoo",
    "image_url": "https://i.postimg.cc/ZKjzWjB1/2329540cbcf70ff5499213159355162a.jpg",
    "quantity": 3,
    "author": "Stieg Larsson",
    "category": "Thriller",
    "short_description": "A psychological thriller novel.",
    "rating": 4,
    "long_description": "The Girl with the Dragon Tattoo is a psychological thriller novel by Swedish author Stieg Larsson, which was published posthumously in 2005 to become an international bestseller. It is the first book of the Millennium series."
  },
  {
    "name": "The Rise and Fall of the Third Reich",
    "image_url": "https://i.postimg.cc/9Qn3pMBb/58cce82e0822f86999185d66447d05dd.jpg",
    "quantity": 4,
    "author": "William L. Shirer",
    "category": "History",
    "short_description": "A historical account of Nazi Germany.",
    "rating": 5,
    "long_description": "The Rise and Fall of the Third Reich: A History of Nazi Germany is a book by William L. Shirer chronicling the rise and fall of Nazi Germany from the birth of Adolf Hitler in 1889 to the end of World War II in 1945."
  },
  {
    "name": "Romeo and Juliet",
    "image_url": "https://i.postimg.cc/3w4sbTST/7da4d06680ac41dbdcc0c02977b68de1.jpg",
    "quantity": 3,
    "author": "William Shakespeare",
    "category": "Drama",
    "short_description": "A tragedy by William Shakespeare.",
    "rating": 4,
    "long_description": "Romeo and Juliet is a tragedy written by William Shakespeare early in his career about two young star-crossed lovers whose deaths ultimately reconcile their feuding families. It was among Shakespeare's most popular plays during his lifetime and, along with Hamlet, is one of his most frequently performed plays."
  },
  {
    "name": "1984",
    "image_url": "https://i.postimg.cc/YS5J5sZm/4375b7d9bf24b88aa53744b417227485.jpg",
    "quantity": 4,
    "author": "George Orwell",
    "category": "Sci-Fi",
    "short_description": "A dystopian social science fiction novel.",
    "rating": 5,
    "long_description": "Nineteen Eighty-Four, often referred to as 1984, is a dystopian social science fiction novel by the English novelist George Orwell. It was published on 8 June 1949 by Secker & Warburg as Orwell's ninth and final book completed in his lifetime."
  },
  {
    "name": "The Catcher in the Rye",
    "image_url": "https://i.postimg.cc/85LqNbgX/4bbe9c695bd2c2005847108120df0612.jpg",
    "quantity": 3,
    "author": "J.D. Salinger",
    "category": "Novel",
    "short_description": "A coming-of-age novel by J.D. Salinger.",
    "rating": 4,
    "long_description": "The Catcher in the Rye is a novel by J. D. Salinger, partially published in serial form in 1945–1946 and as a novel in 1951. It was originally intended for adults, but is often read by adolescents for its themes of angst and alienation, and as a critique on superficiality in society."
  },
  {
    "name": "The Silence of the Lambs",
    "image_url": "https://i.postimg.cc/NFYZMrgs/4431a0d2d4fea80e0e98a45b1254a84a.jpg",
    "quantity": 2,
    "author": "Thomas Harris",
    "category": "Thriller",
    "short_description": "A psychological horror thriller novel.",
    "rating": 4,
    "long_description": "The Silence of the Lambs is a psychological horror thriller novel by Thomas Harris. First published in 1988, it is the sequel to Harris's 1981 novel Red Dragon. Both novels feature the cannibalistic serial killer Dr. Hannibal Lecter."
  },
  {
    "name": "A Brief History of Time",
    "image_url": "https://i.postimg.cc/0jfFJ2Qp/0e4a3b402a182777a4b3420efbf64be3.jpg",
    "quantity": 4,
    "author": "Stephen Hawking",
    "category": "Sci-Fi",
    "short_description": "A popular science book about cosmology.",
    "rating": 5,
    "long_description": "A Brief History of Time: From the Big Bang to Black Holes is a popular-science book by the English physicist Stephen Hawking, first published in 1988. It covers the history of the universe, from the Big Bang to black holes."
  },
  {
    "name": "The Great Gatsby",
    "image_url": "https://i.postimg.cc/dQmzfnBL/740551c3cec86af92fb97ffcf78404cf.jpg",
    "quantity": 2,
    "author": "F. Scott Fitzgerald",
    "category": "Novel",
    "short_description": "A novel about the American Dream.",
    "rating": 4,
    "long_description": "The Great Gatsby is a novel written by American author F. Scott Fitzgerald that follows a cast of characters living in the fictional towns of West Egg and East Egg on prosperous Long Island in the summer of 1922."
  },
  {
    "name": "The Hobbit",
    "image_url": "https://i.postimg.cc/sDjtCS6K/5081fd34b51669122589480f3bdeaa4f.jpg",
    "quantity": 5,
    "author": "J.R.R. Tolkien",
    "category": "Drama",
    "short_description": "A fantasy novel by J.R.R. Tolkien.",
    "rating": 5,
    "long_description": "The Hobbit, or There and Back Again is a children's fantasy novel by English author J. R. R. Tolkien. It was published on 21 September 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction."
  },
  {
    "name": "The Bourne Identity",
    "image_url": "https://i.postimg.cc/fLQr20Sc/6a51efbf5b7587aba0e5b02c305c035d.jpg",
    "quantity": 6,
    "author": "Robert Ludlum",
    "category": "Thriller",
    "short_description": "A spy fiction thriller novel.",
    "rating": 4,
    "long_description": "The Bourne Identity is a spy fiction thriller novel by Robert Ludlum that tells the story of Jason Bourne, a man with remarkable survival abilities who has retrograde amnesia, and must seek to discover his true identity."
  },
  {
    "name": "The Art of War",
    "image_url": "https://i.postimg.cc/LXk0r6jr/fcb80bdd1d0018b0ad136ef0b731f9ff.jpg",
    "quantity": 4,
    "author": "Sun Tzu",
    "category": "History",
    "short_description": "An ancient Chinese military treatise.",
    "rating": 5,
    "long_description": "The Art of War is an ancient Chinese military treatise dating from the Late Spring and Autumn Period. The work, which is attributed to the ancient Chinese military strategist Sun Tzu, is composed of 13 chapters."
  },
  {
    "name": "The Name of the Rose",
    "image_url": "https://i.postimg.cc/D02YFkgm/46741fa4d7b21e5157a2444cd7a875d1.jpg",
    "quantity": 7,
    "author": "Umberto Eco",
    "category": "History",
    "short_description": "A historical murder mystery novel.",
    "rating": 4,
    "long_description": "The Name of the Rose is the 1980 debut novel by Italian author Umberto Eco. It is a historical murder mystery set in an Italian monastery in the year 1327, and an intellectual mystery combining semiotics in fiction, biblical analysis, medieval studies, and literary theory."
  },
  {
    "name": "The Martian",
    "image_url": "https://i.postimg.cc/ZnVs577H/2dbe271a57cccfd9a56ee17d9ad8b00f.jpg",
    "quantity": 5,
    "author": "Andy Weir",
    "category": "Sci-Fi",
    "short_description": "A science fiction novel about an astronaut stranded on Mars.",
    "rating": 4,
    "long_description": "The Martian is a science fiction novel written by Andy Weir. It follows an American astronaut, Mark Watney, as he becomes stranded alone on Mars in the year 2035 and must improvise in order to survive."
  },
  {
    "name": "Crime and Punishment",
    "image_url": "https://i.postimg.cc/8kH04cpv/979d036f42a9ad54d619663e0c5c42ba.jpg",
    "quantity": 6,
    "author": "Fyodor Dostoevsky",
    "category": "Novel",
    "short_description": "A psychological thriller novel.",
    "rating": 5,
    "long_description": "Crime and Punishment is a novel by the Russian author Fyodor Dostoevsky. It was first published in the literary journal The Russian Messenger in twelve monthly installments during 1866. It is the second of Dostoevsky's full-length novels following his return from ten years of exile in Siberia."
  },
  {
    "name": "The Shining",
    "image_url": "https://i.postimg.cc/dtVSxF3x/8ae870b9a15570eb8968515f61553623.jpg",
    "quantity": 2,
    "author": "Stephen King",
    "category": "Novel",
    "short_description": "A horror novel by Stephen King.",
    "rating": 4,
    "long_description": "The Shining is a horror novel by American author Stephen King. Published in 1977, it is King's third published novel and first hardback bestseller: the success of the book firmly established King as a preeminent author in the horror genre."
  },
  {
    "name": "War and Peace",
    "image_url": "https://i.postimg.cc/02XHg4J2/dbf26bcc5b7fccac8fab08ed2de7d4c6.jpg",
    "quantity": 4,
    "author": "Leo Tolstoy",
    "category": "History",
    "short_description": "A historical novel about Napoleon's invasion of Russia.",
    "rating": 5,
    "long_description": "War and Peace is a novel by the Russian author Leo Tolstoy, published serially, then in its entirety in 1869. It is regarded as one of Tolstoy's finest literary achievements and remains a classic of world literature."
  },
  {
    "name": "The Hitchhiker's Guide to the Galaxy",
    "image_url": "https://i.postimg.cc/y8MMtNDT/ae9a7b3584b69ae9708c66507edcd4df.jpg",
    "quantity": 2,
    "author": "Douglas Adams",
    "category": "Sci-Fi",
    "short_description": "A comic science fiction series.",
    "rating": 5,
    "long_description": "The Hitchhiker's Guide to the Galaxy is a comic science fiction series created by Douglas Adams. Originally a radio comedy broadcast on BBC Radio 4 in 1978, it was later adapted to other formats, including novels, comic books, and stage shows."
  },
  {
    "name": "Frankenstein",
    "image_url": "https://i.postimg.cc/VkSZzFj9/9437811edf3de19193848c78a576a4a9.jpg",
    "quantity": 3,
    "author": "Mary Shelley",
    "category": "Sci-Fi",
    "short_description": "A Gothic science fiction novel.",
    "rating": 4,
    "long_description": "Frankenstein; or, The Modern Prometheus is a novel written by English author Mary Shelley that tells the story of Victor Frankenstein, a young scientist who creates a sapient creature in an unorthodox scientific experiment."
  },
  {
    "name": "Brave New World",
    "image_url": "https://i.postimg.cc/bvk6tNVs/4de4461b2faf2356cfc3954c978f9485.jpg",
    "quantity": 6,
    "author": "Aldous Huxley",
    "category": "Sci-Fi",
    "short_description": "A dystopian novel.",
    "rating": 4,
    "long_description": "Brave New World is a dystopian novel by English author Aldous Huxley, written in 1931 and published in 1932. Largely set in a futuristic World State, whose citizens are environmentally engineered into an intelligence-based social hierarchy, the novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation, and classical conditioning that are combined to make a utopian society that goes challenged only by a few philosophical characters such as John the Savage."
  },
  {
    "name": "The Count of Monte Cristo",
    "image_url": "https://i.postimg.cc/hj0p2ZBn/c020ec06cd28468aefff4abc443fdf7d.jpg",
    "quantity": 6,
    "author": "Alexandre Dumas",
    "category": "Thriller",
    "short_description": "An adventure novel by Alexandre Dumas.",
    "rating": 5,
    "long_description": "The Count of Monte Cristo is an adventure novel by French author Alexandre Dumas (père) completed in 1844. It is one of the author's most popular works, along with The Three Musketeers. Like many of his novels, it was expanded from plot outlines suggested by his collaborating ghostwriter Auguste Maquet."
  },
  {
    "name": "Jurassic Park",
    "image_url": "https://i.postimg.cc/tJSDj1Jm/fb274ab73267d65be3da7e33a21592c2.jpg",
    "quantity": 6,
    "author": "Michael Crichton",
    "category": "Sci-Fi",
    "short_description": "A science fiction thriller novel.",
    "rating": 4,
    "long_description": "Jurassic Park is a science fiction novel written by Michael Crichton, divided into seven sections (iterations). A cautionary tale about genetic engineering, it presents the collapse of an amusement park showcasing genetically re-created dinosaurs to illustrate the mathematical concept of chaos theory and its real-world implications."
  },
  {
    "name": "Moby-Dick",
    "image_url": "https://i.postimg.cc/ryQfWHjC/78f1a9d67c5f90ecae81977ae3b0ef4f.jpg",
    "quantity": 6,
    "author": "Herman Melville",
    "category": "Novel",
    "short_description": "A novel by Herman Melville.",
    "rating": 4,
    "long_description": "Moby-Dick; or, The Whale is an 1851 novel by American writer Herman Melville. The book is the sailor Ishmael's narrative of the obsessive quest of Ahab, captain of the whaling ship Pequod, for revenge on Moby Dick, the giant white sperm whale that on the ship's previous voyage bit off Ahab's leg at the knee."
  },
  {
    "name": "The Adventures of Sherlock Holmes",
    "image_url": "https://i.postimg.cc/X7Px1yTr/b3c0b8c3618066e8ca1569a28e553445.jpg",
    "quantity": 5,
    "author": "Arthur Conan Doyle",
    "category": "Drama",
    "short_description": "A collection of detective stories.",
    "rating": 5,
    "long_description": "The Adventures of Sherlock Holmes is a collection of twelve short stories by Arthur Conan Doyle, featuring his fictional detective Sherlock Holmes. It was first published on 14 October 1892, though the individual stories had been serialized in The Strand Magazine between June 1891 and July 1892."
  },
  {
    "name": "Alice's Adventures in Wonderland",
    "image_url": "https://i.postimg.cc/JhVxMC7m/1dafc20ab756abe438600106d9219748.jpg",
    "quantity": 5,
    "author": "Lewis Carroll",
    "category": "Drama",
    "short_description": "A children's novel by Lewis Carroll.",
    "rating": 4,
    "long_description": "Alice's Adventures in Wonderland is an 1865 novel written by English author Lewis Carroll. It tells of a young girl named Alice, who falls through a rabbit hole into a subterranean fantasy world populated by peculiar, anthropomorphic creatures."
  },
  {
    "name": "Dracula",
    "image_url": "https://i.postimg.cc/Xv6PxDPH/aafca49777c04cd3cfc68ee775de35d2.jpg",
    "quantity": 5,
    "author": "Bram Stoker",
    "category": "Thriller",
    "short_description": "A Gothic horror novel.",
    "rating": 4,
    "long_description": "Dracula is an 1897 Gothic horror novel by Irish author Bram Stoker. It introduced the character of Count Dracula and established many conventions of subsequent vampire fantasy. The novel tells the story of Dracula's attempt to move from Transylvania to England so that he may find new blood and spread the undead curse, and of the battle between Dracula and a small group of people led by Professor Abraham Van Helsing."
  },
  {
    "name": "The War of the Worlds",
    "image_url": "https://i.postimg.cc/nz0wFVhg/4ff891f92519b12f0d699f672dc0cbeb.jpg",
    "quantity": 5,
    "author": "H.G. Wells",
    "category": "Sci-Fi",
    "short_description": "A science fiction novel about a Martian invasion of Earth.",
    "rating": 4,
    "long_description": "The War of the Worlds is a science fiction novel by English author H. G. Wells, first serialized in 1897 by Pearson's Magazine in the UK and by Cosmopolitan magazine in the US. The novel's first appearance in hardcover was in 1898 from publisher William Heinemann of London."
  },
  {
    "name": "The Odyssey",
    "image_url": "https://i.postimg.cc/yYwpYb71/508f31281bca1b5ab0a2e3c8209d5f11.jpg",
    "quantity": 5,
    "author": "Homer",
    "category": "Novel",
    "short_description": "An ancient Greek epic poem attributed to Homer.",
    "rating": 5,
    "long_description": "The Odyssey is one of two major ancient Greek epic poems attributed to Homer. It is one of the oldest extant works of literature still read by contemporary audiences. As with the Iliad, the poem is divided into 24 books."
  }
]